# GetAllPartCustomData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllPartCustomData Method
FabricationConfiguration Class See Also
---
Gets all possible fabrication part custom data identifiers.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public IList<int> GetAllPartCustomData()
```

Visual Basic
---
```text
Public Function GetAllPartCustomData As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetAllPartCustomData()
```

# ### Return Value
An array of custom data identifiers.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace